Update readme to include mermaid graph and update readme description to reduce misunderstanding
